{  "Displayname": "CIPP: Onboard EDR",  "Description": "",  "RAWJson": "{\r\n  \"name\": \"CIPP: Onboard EDR\",\r\n  \"description\": \"\",\r\n  \"settings\": [\r\n    {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n        \"choiceSettingValue\": {\r\n          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n          \"children\": [\r\n            {\r\n              \"settingDefinitionId\": \"device_vendor_msft_windowsadvancedthreatprotection_onboarding_fromconnector\",\r\n              \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n              \"simpleSettingValue\": {\r\n                \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSecretSettingValue\",\r\n                \"valueState\": \"NotEncrypted\",\r\n                \"value\": \"autoConnectPlaceholder\"\r\n              }\r\n            }\r\n          ],\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"e5c7c98c-c854-4140-836e-bd22db59d651\"\r\n          },\r\n          \"value\": \"device_vendor_msft_windowsadvancedthreatprotection_configurationtype_autofromconnector\"\r\n        },\r\n        \"settingDefinitionId\": \"device_vendor_msft_windowsadvancedthreatprotection_configurationtype\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"23ab0ea3-1b12-429a-8ed0-7390cf699160\"\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n        \"choiceSettingValue\": {\r\n          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n          \"children\": [],\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"f72c326c-7c5b-4224-b890-0b9b54522bd9\"\r\n          },\r\n          \"value\": \"device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing_1\"\r\n        },\r\n        \"settingDefinitionId\": \"device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"6998c81e-2814-4f5e-b492-a6159128a97b\"\r\n        }\r\n      }\r\n    }\r\n  ],\r\n  \"roleScopeTagIds\": [\r\n    \"0\"\r\n  ],\r\n  \"platforms\": \"windows10\",\r\n  \"technologies\": \"mdm,microsoftSense\",\r\n  \"templateReference\": {\r\n    \"templateId\": \"0385b795-0f2f-44ac-8602-9f65bf6adede_1\"\r\n  }\r\n}",  "Type": "Catalog",  "GUID": "458bc263-5785-416a-be89-77f6bdf7858e"}