{
  "name": "CIPP: Onboard EDR",
  "description": "",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "children": [
            {
              "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_onboarding_fromconnector",
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSecretSettingValue",
                "valueState": "NotEncrypted",
                "value": "autoConnectPlaceholder"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "e5c7c98c-c854-4140-836e-bd22db59d651"
          },
          "value": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype_autofromconnector"
        },
        "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "23ab0ea3-1b12-429a-8ed0-7390cf699160"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "f72c326c-7c5b-4224-b890-0b9b54522bd9"
          },
          "value": "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing_1"
        },
        "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "6998c81e-2814-4f5e-b492-a6159128a97b"
        }
      }
    }
  ],
  "roleScopeTagIds": [
    "0"
  ],
  "platforms": "windows10",
  "technologies": "mdm,microsoftSense",
  "templateReference": {
    "templateId": "0385b795-0f2f-44ac-8602-9f65bf6adede_1"
  }
}